def logo():
    return ("*************************************************************************************************\n"
            "                                 Quest. Survival: Finding Hope\n"
            "*************************************************************************************************\n")

def history():
    return ("  Вы пробрались в пекарю. Пыль и пепелл лежали повсюду, затушенный свет проникал сквозь треснутые заколоченые окна,\n"
            "освещая раскиданные на полу упаковки с плесневелыми продуктами и обгоревшими мешками с крупами.\n"
            "  Проходя все глубже, вы почувствовал дурной запах гари и разрушений.\n"
            "На полке за прилавком были разложены обугленные куски хлеба,\n"
            "а на столах стояли пыльные формы для выпечки, забытые в хаосе катастрофы.\n"
            "С потолка свисали обгоревшие шторы, создавая мрачную атмосферу.\n\n")

def look_around():
    return (" Вы находитесь по середине главного зала перед стойкой где когда-то продовали вкусные булочки.\n"
            "Позади вас главный вход через который вы вошли, окна заколочены но выгледят крепко.\n"
            "Слева от стойки дверь в небольшую подсобку плавно вытикающую в запасной выход\n"
            "Справа коридор в глубь здания если сделать пару шагов в право то веднеется какая-то комната.\n")

def utility_room():
    return (" Вы проходите в подсобку, здесь кукча пустых пыльных полок,\n"
            "хотя если приглядеться то сверху лежит какая-то странная коробка\n"
            "на вид как будто оставленная недавно\n"
            "*-Это странно* сказали вы.\n")

def counter():
    return ("  Зайдя за прилавок вы подошли к стелажам где до этого лежала выпечка, в надежде что что-то осталось."
            "Но здесь пусто.\n")

def stock():
    return ("  Вы продвигаетесь в глубь по коридору в конце которого слева находится комната\n"
            "Это был склад *-интересно здесь осталось что нибуть съестного?* Вы прошли вынутрь.\n")


def stock_2():
    return ("  Вы продвигаетесь в глубь по коридору к складу\n")


def box():
    return ("  Вы достали коробку с верхней полки, на вид совсем новая.\n"
            "Внутри куча разного хлама бумажки фаньтики и прочий мусор.\n"
            "Но на обороте одной из бумажек вам попался на глаза странный текст.\n\n"
            "*********************************************************************\n"
            "Я надеюсь ты нашел предыдущую записку и сейчас читаешь эту.\n"
            "Ситуация критическая - у нас заканчиваются припасы в убежище, и, к тому же,\n"
            "мы все еще не смогли разработать лекарство, который является ключом к выживанию всех нас.\n"
            "Только ты можешь помочь создать его и спасти нас от гибели.\n"
            "Пароль от двери - 'Cпасение'.\n"
            "Скорее всего, ты уже понял, что это не пустая тревога.\n"
            "Пожалуйста, отыщи его и приходи как можно скорее.\n"
            "**********************************************************************\n\n"
            "Пока он читает вторую записку, слова на ней кажутся ему какими-то знакомыми. \n"
            "В голове героя возникают отрывочные воспоминания о предыдущем посещении этого места, \n"
            "вспоминает про déjà vu. Он вспоминает моменты из прошлого визита.\n"
            "Но почему же все кажется вам таким незнакомым? Почему вы не помнит детали своего предыдущего пребывания здесь? "
            "Герой осознает, что его память как будто заблокировала какая-то сила, "
            "и только нахождение déjà vu из воспоменаний может помочь ему разгадать тайну своего прошлого и восстановить утраченные воспоминания. "
            "С решимостью в сердце он понимает, что теперь ему необходимо найти déjà vu, который, как он чувствует, "
            "является ключом к разгадке всех его загадок и тайн. Герой берет в руки вторую записку, набирается сил и отправляется на поиски клада,"
            "который, он надеется, окажет ему помощь в восстановлении потерянных воспоминаний и прошлого.")


def food():
    return("  Вы долго осматривали стеллажи, перебирая каждую полку и каждый уголок в поисках еды.\n"
           "Пристально рассматривая каждую коробку, каждый пакет и каждый контейнер, надеясь найти хоть что-то.\n"
           "  Вдруг ваш взгляд зацепил маленькую, пыльную консервную банку, забытую в углу на верхней полке за кучей коробок\n"
           "и прочим хламом. Надпись на банке была стерта, но вес банки говорил о том, что внутри что-то находится.\n"
           "  С трудом вы открыли банку и обнаружил небольшое количество консервированных овощей. Хоть это было немного,\n"
           "но в условиях нехватки припасов каждая находка была ценна.\n\n")

def secret_door():
    return ("Отодвинув один из стелажей вы оказались перед дверью протерев от пыли надпись *Подвал*\n"
            "возле двери разположена сенсорная панель для ввода пароля.\n")


def second_check():
    return (" Осмотрев все еще раз вы заметили замаскированную дверь в углу помещения с неразборчивой\n"
            "надписью. Из-под щели двери доносился холодный влажный воздух, заставивший\n"
            "вас почувствовать дрожь по спине.\n")


def open_door():
    return ("Получилось сенсорная панель загорелась зеленым, вы стали слышать скрежет открытия множество замков."
            "Дверь немного отварилась, как вдруг...")