

def second_history():
        return ("*************************************************************************************************\n"
                "                                 Quest. Survival: Finding Hope\n"
                "*************************************************************************************************")




def third_history():
        return ("Вы медленно открывает глаза и осознаете, что ваше сознание погружено в туман. \n"
                "Вокруг него царит полная тишина, лишь слабый свет проникает через узкое окно, освещая незнакомую комнату. \n"
                "Ваша память пуста, словно лист бумаги, на котором не осталось ни одного слова.\n"
                "Он поднимается с постели, ощущая странное ощущение дезориентации. Комната, в которой он находится, кажется незнакомой и загадочной. \n"
                "Стены украшены тусклыми картиными, мебель покрыта слоем пыли, а в углу стоит старинный шкаф с вырезанными узорами..\n\n")





def look_out_window():
    return ("\nГерой подходит к узкому окну, из которого проникает бледный свет. \n"
            "Он осторожно приоткрывает занавески и выглядывает на улицу. \n"
            "Перед ним открывается вид на узкую улочку, усеянную старыми кирпичными зданиями и замшелыми крышами.\n\n"
            "Постепенно, глядя на улочку и окружающие здания, герой начинает почувствовать какие-то отдельные моменты и образы, \n"
            "которые словно мелькают в его уме. Он видит фрагменты прошлого: \n"
            "Пыль и пепелл лежали повсюду, непонятный гул, дурной запах гари и разрушений.\n\n"
            "Эти мельчайшие детали начинают складываться в картины, которые по-прежнему остаются размытыми и неопределенными, \n"
            "но они приносят герою какое-то успокоение и чувство, что ответы на его вопросы где-то рядом, в его собственных воспоминаниях.\n")


def Inspect_room():
    return ("Герой внимательно осматривает комнату, пытаясь обнаружить какие-либо подсказки о своей личности или о причинах своего нахождения в этом месте. \n"
            "Он замечает старинный шкаф с изящной резьбой, покрытый слоем пыли, словно не тронутый долгое время.\n"
            "Перед героем открывается дверь, ведущая наружу, сквозь которую проникает слабый свет. \n"
            "Он видит узкий коридор, тускло освещенный тусклой лампой, и чувствует, что за этой дверью может скрываться ответ на его загадочное положение.\n"
            "Напротив двери находится окно, через которое проникает бледный свет застывшего утра.\n"
            "Затем герой обращает внимание на дверь, ведущую ванную комнату.\n")

def door_bathroom():
    return ("\n Он подходит к ней и осторожно открывает. Внутри он видит старинную ванну на львиных лапах, мраморные стены и небольшое зеркало в золоченой раме.\n"
            "Атмосфера ванной комнаты наполнена тишиной и спокойствием, словно она ждет своего хозяина, чтобы вернуться к жизни.\n"
            "Подойдя к зеркалу вы понимаете что его можно открыть, внутри вы находите бинт.\n")

def closet():
    return ("\nГерой подходит к старинному шкафу и осторожно открывает его дверцу. Внутри он обнаруживает ряд чистых, аккуратно сложенных вещей. \n"
            "Там лежат различные предметы одежды, начиная от пастельных рубашек до темных брюк.\n"
            "Герой решает взять с собой несколько вещей из шкафа и переодеться.\n")


def exit():
    return ("\nДернув дверь туда сюда несколько раз у тебя так и не получилос открыть её. (я что Вадим Нагорнов?)\n"
            "включив голову ты посмотрел на ручку двери и обнаружил возле нее кодовый замок [значения 1-5]\n"
            "придеться угадывать....\n\n")


def pered_quiet_exit():
    return ("Несмотря на амнезию, герой чувствует в себе непоколебимую решимость выяснить правду о себе и своем прошлом. \n"
            "Покидая незнакомую комнату, он понимает, что его путь будет трудным и опасным, но он готов к любым испытаниям, \n"
            "чтобы вернуть себе свою память и свою личность.\n")


def quiet_exit():
    return ("Вы выходит на задний двор, где вас встречает удивительный вид. "
            "Перед ним раскинулся просторный сад с зеленым газоном, а вокруг растут высокие деревья.\n"
            "В доль забора растут различные вкусно пахнующие цветочки,\n"
            "во дворе стоит небольшой столик с кресло-качалкой на столе лежат газетки с новостями,\n"
            "Затем герой обращает внимание на вывеску, которая указывает на пекарню всего в 500 метрах отсюда.\n")

def newspaper():
    return  ("Герой приближается к столику, стоящему посреди сада. На нем лежит свежая газета, на странице которой видны заголовки новостей. \n"
             "Он поднимает газету и быстро просматривает ее содержимое, в надежде найти какую-то информацию, \n"
             "которая поможет ему разгадать тайну своего пребывания в этом месте.\n\n"
             "************************************************************************\n"
             "                            ГАЗЕТА НЮВС\n"
             "                          СРОЧНЫЕ НОВОСТИ\n"
             "************************************************************************\n"
             "В мире происходит что-то невероятное трупы ходят по городам благовещенска,\n"
             "       Уважаемые граждане, в связи с непонятными проишествиями,\n"
             "        необходимо соблюдать следующие меры предосторожности:\n"
             "\n"
             "1.Не выходить на улицу без крайней необходимости.\n"
             "2.Запаситесь продовольствием, водой и медикаментами на несколько дней.\n"
             "3.Избегайте контакта с зараженными лицами.\n"
             "4.В случае нападения на вас, немедленно обращайтесь за помощью \n"
             "                к специализированным службам.\n"
             "************************************************************************\n"
             "Надеемся на ваше понимание и сотрудничество в борьбе с угрозой.\n"
             "                Берегите себя и своих близких!\n\n"
             "когда вы клали ее наместо то заметили на обороте странное письмо\n")


def telegram():
    return ("Герой с любопытством читает газету, пытаясь найти какую-то подсказку или информацию. \n"
            "Внезапно, его взгляд падает на обратную сторону газеты, где он замечает нечто необычное - написанное от руки сообщение. \n"
            "На бумаге четко прописано: 'Тебе нужно посетить пекарню, там найдешь ответы.'\n")


def bakery():
    return ("С твердым намерением исследовать эту загадочную подсказку, герой направляется к пекарне, полагаясь на то, что там его ждет ключ к разгадке его таинственного приключения. \n"
            "Его уверенность в том, что пекарня сможет дать ему ответы, растет с каждым шагом, и он чувствует, что это может быть поворотным моментом в его странном путешествии."
            "В переулке стоят 2 человека??\n")

def home():
    return ("Подойдя к соседнему дому ты понимаеь что он и все остальные дома хорошо заперты изнутри.\n"
            "Нужно иди к пекарне там я надуй и еду и ответы.\n")

def directly():
    return ("Вы вышли за забор и напрявляетесь увереной походкой в сторону пекарни ДЖОНА\n"
            "подойтя поближе вы замечаете что здесь что то не так пекарня закалочена досками, стоят барекады,\n"
            "как будто здесь держали оборону, вы пробераетесь к двери пытаетесь ее открыт но вам мешает доска"
            "со внутреней стороны, она выглядит ненадежной как будто ее приколотили в спешке,\n"
            "можно попробовать толкнуть дверь чтобы ввыбить её.\n")

def carefully():
    return ("Вы акуратно выходите за забор и нагнувшись двигаетесь вдоль забор и укрываясь за машинами\n"
            "проходя мимо переулка вы замечаете что эти люди очень странно выглядят\n"
            "*как хорошо что я неполез к ним с вопросами* Подумали вы.\n"
            "подойтя поближе к пекарне вы замечаете что здесь что то не так пекарня закалочена досками, стоят барекады,\n"
            "как будто здесь держали оборону, вы двигаетесь на корточках к двери замечаете что\n"
            "дверь заколочена с внутреней стороны.\n"
            "осмотревшись вы нашли небольшую форточку с задней стороны пекарни и решаете залезть через нее.\n\n"
            "вас не заметили.\n\n"
            "*************************************************************************************************\n"
            "                                 Quest. Survival: Finding Hope\n"
            "*************************************************************************************************\n"
            "                                     Продолжение следует....\n\n")

def Strangers():
    return ("Вы выходите за забор и двигаетесь через дорогу к переулку\n"
            "не дойдя 10 метров вы выкрикиваете вопрос *-извините вы не знаете что здесь происходит?*\n"
            "в ответ эта двойца СРЫВАЕТСЯ! С МЕСТА И В МГНОВЕНИЕ ОКАЗЫВАЕТСЯ ПЕРЕД ВАШИМ НОСОМ!\n"
            "КУСАЯ ЗА ГОРЛО!? РУКИ! ВАЛИТ ВАС НА ЗЕМЛЮ И НАЧИНЕТ ОБГЛАДЫВАТЬ\n"
            "вы кричите превликая все больше внимания таких дружелюбных людей\n"
            "кровь хлыщит отовсюду, мгновение и вам становится так тепло и спокойно\n"
            "вы закрываете глаза и больше ни кода их не откроете.\n\n")


#-----------------------------------------------------------------------------------------------------------------------------------------


def dangerous_exit():
    return ("в последнию секунду перед тем как они пробрались внуцтрь \n"
            "вы сумели открыть дверь и выбежать наружу\n"
            "сердце бешено колотится, но это сейчас не имеет значения\n"
            "ОНИ ИДУТ! вы в ступоре стоите по середине заденго дворика\n"
            "и не занете что делать, они уже рядом!.\n"
            "Ваши действия? у вас 10сек\n")

def quick_look_around():
    return ("Вы начинаете быстро вереть головой по сторона в попытках найтис пасения\n"
            "дерево! стол! дорога!\n"
            "что делать????????\n")

def scream():
    return ("Вы набираете побольше воздуха и нчинаете орать в их сторону\n"
            "СТОЯТЬ! Я ВООРУЖЕН! БУДУ СТРЕЛЯТЬ! НЕ ПОДХОДИТЕ! БЛЯТЬ НИ ШАГУ БОЛЬШЕ!\n"
            "это ни как не повлияло на ситуацию\n")

def close_the_door():
    return ("Вы срываетесь с места и бежите к двери в попытке ее закрыть\n"
            "вы почти сумели ее закрыть но рука одного из этих ребять застряла в проеме\n"
            "вы удерживаете дверь некоторое время но долго вы так не простоите.\n")


def run_away():
    return ("бежать куда глаза глядят, а что не плохая идея может наткнусь на помощь\n"
            "вы бегаете по улочкам суеттисеь и рано или поздно забегаете в тупик.\n")

def climb_a_tree():
    return ("Подбежав к дереву вы пытаетесь хоть как-то на него залезть но у вас не получается т.к\n"
           "оно очень больше и его не получается обхватить и зацепиться тоже не за что.\n"
           "в неудачных попытках забраться вас настигают ходячие.\n")

def table():
    return("*Я че дурак под столом сидеть?* включай голову должен же быть вариант как спастись\n")

def run_the_road():
    return ("отпустив дверь вы выбегаете на дорогу и бежите вдоль нее\n")


def run_the_bakery():
    return ("Пробежав метров 100 вы сравнялись с переулком пробегая мимо которого вы практичсеки в упор разглядели\n"
            "одну из этих тварей, мужчина с искалеченной гниющей кожей и кровавыми ранами.\n"
            "Его глаза были полые и безжизненные, а изо рта течь густая черная жидкость.\n"
            "Он был одет в разорванную и запачканную одежду, в которой можно было увидеть куски мяса и кости.\n"
            "Его шаги были неуклюжими и неестественными, как у мертвец.\n"
            "*-Те в начале еще свежачки* подумали вы ускоряя свой бег\n")


def run_the_bakery_2():
    return ("Пробежав еще пару десятков метров с хвостом из трупов\n"
            "Вы замечаете на углу укрепленное зднаие с вывеской пекарня ДЖОНА\n"
            "-Что же здесь творится раз обычняа пекарня так креплена?\n"
            "Вы берете курс в ее сторону в надежте там укрытся от этой голодной толпы.\n")

def punch_forward():
    return("Разогнавшись вы перепрыгиваете через барикады, но неудачно преземляетесь и повреждаете правую руку\n"
           "поднявшись вы осматрели травму, но ничего серьезного просто ссдаина\n"
           "направляясь ко входу вы заметили что вам мешает доска\n"
           "со внутреней стороны двери, она выглядит ненадежной как будто ее приколотили в спешке,\n"
           "можно попробовать толкнуть дверь чтобы ввыбить её.\n")


def heal():
    return("Ты достаешь из кормана кусочек бинта и начинаешь быстренько перематывать руку\n"
           "затем переключаешься на дверь\n")


def No_heal():
    return ("Мда вот бы он у меня был ну нечего до свадьбы все пройдет.\n")

def punch_door():
    return ("Вы делаете пару шагов назад и с разбегу врзеаетесь вдверь\n"
            "Получилось доска отлетела дверь приоткрылась, но побаливает рука\n"
            "нужно идти внутрь пока разьяренная толпа еще далеко\n")

def punch_door_2():
    return ("Ударив ногой пару раз у вас все же получилось пробиться внутрь\n"
            "нужно идти пока разьяренная толпа еще далеко\n")

def behind_bakery():
    return ("Забегая за пекарню у вас есть немного времни чтобы осматреться\n"
            "oсмотревшись вы нашли небольшую форточку делать нечего придеться залезть через нее.\n")

