def logo():
    return ("*************************************************************************************************\n"
            "                                 Quest. Survival: Finding Hope\n"
            "*************************************************************************************************")


def description_situation():
    return (" Дверь приоткрывается как вдруг неподалеку происходит мощный взрыв, \n"
            "от ударной волны повылетали остатки стекл, здание накринилось.\n"
            "вас отбросило в стену не надолго потеряв сознаие,\n"
            "придя в себя вы слышите приближающийся гул, похоже зомби со всего города идут сюда.\n")

def basement():
    return ("Войдя внутрь, герой ощущает мрачную атмосферу и видит, что это лаборатория.\n"
            "Проходя мимо столов и стеллажей с лабораторным оборудованием, герой случайно натыкается на стол,\n"
            "на котором лежит старая записная книжка. \n\nЗаметив ее, герой начинает просматривать страницы и вдруг осознает,\n"
            "что эти записи и формулы ему знакомы. В его голове возникают воспоминания о работе в этой лаборатории в прошлом.\n"
            "Герой вспоминает, что он действительно разрабатывал формулу лекарства от зомби-вируса, но по каким-то причинам позабыл \n"
            "о своих исследованиях и результате. Теперь, благодаря находке записной книжки, все начинает возвращаться в его память.\n")


def basement_1():
    return ("Лаборатория была окутана пылью и запахом химических испарений.\n"
            "Главный зал, в который входил герой, был просторным помещением с высоким потолком.\n"
            "На потолке горели четыре яркие лампочки, озаряя все уголки комнаты.\n"
            "Справа и слева от главного зала находились коридоры, по которым располагались по две комнаты.\n"
            "В комнатах были разбросаны различные научные приборы, стойки с пробирками и микроскопами а так же 'панели'. \n"
            "Воздух наполнял запах химикатов и металла, создавая атмосферу загадочности и опасности.\n"
            "Главная дверь лаборатории находилась напротив входа и была закрыта. Чтобы ее открыть,\n"
            "необходимо было активировать специальные панели, который активировал механизм отпирания.\n"
            "Герой понимал, что он должен быстро все решить, иначе ему не удастся покинуть опасное место,\n"
            "где его подстерегала опасность на каждом шагу.\n"
            "У вас 5 минут!\n")
def ground():
    return ("Подвергнувшись сразу двум опасностям — зомби и взрыву, вы решаете остаться на поверхности. \n"
            "Хаос и паника овладевают окружающим пространством, вынуждая вас действовать моментально.\n")

def run_door():
    return ("Понимая, что время на исходе, вы решаете пойти через главную дверь, надеясь найти спасение.\n"
            "Открыв её, вы выходите наружу и видите, как неподалеку происходит взрыв.\n"
            "Раздаётся оглушительный грохот, и волны радиации сбивают вас с ног.\n"
            "В последние мгновения вы осознаёте, что спасение оказалось недостижимым,\n"
            "и ваша судьба оказалась заключена в этой опустошенной местности.\n"
            "Следы вашего присутствия исчезнут в хаосе апокалипсиса, который охватил мир.\n")

def defender():
    return ("Герой с бесстрашием боролся за каждый уголок здания, отбрасывая врагов и не давая им ни шанса на проникновение.\n"
            "Однако, спустя время, он осознал, что борьба напрасна. Врагов было слишком много, они наступали бесконечными волнами,\n"
            "и герой понял, что он обречен. Его силы стали иссякать, а надежда на спасение постепенно угасала.\n"
            "Спустя мгновение герой понял, что его судьба уже была предопределена. Он приготовился к последней попытке обороны, зная, \n"
            "что это будет его последний бой. Но в этот момент он почувствовал в себе нечто новое – решимость и смирение.\n "
            "Он был готов принять свою участь и погибнуть за свое дело.\n")

def back_door():
    return ("Герой, осознав, что его судьба уже почти решена, решил в последнюю минуту попытаться спастись через запасной выход.\n"
            "Сердце его бешено колотилось, а в ушах звучал ревущий шум столпотворенных врагов.\n"
            "Скользя по полу, герой мчался к запасному выходу, пытаясь пробиться сквозь переплетение обрушившихся стен.\n"
            "Когда он наконец добежал до запасного выхода, он заметил, что дверь уже обвалилась под напором врагов.\n"
            "Герою не осталось выбора – он был обречен на гибель в этом здании. С силой отчаяния он повернулся назад, готовясь к последней битве.\n")

def medicament():
    return ("После того как герой успешно отгадал все загадки, и пришел в финальную комнату. \n"
            "Здесь его ждало последнее испытание - создание лекарства, которое спасет человечество.\n"
            "Вокруг героя были разбросаны различные ингредиенты и алхимическое оборудование. \n"
            "С помощью знаний и опыта, накопленных во время прохождения предыдущих испытаний, \n"
            "герой начал сочетать ингредиенты.\n"
            "Он тщательно измерял каждый ингредиент, точно соблюдая пропорции и последовательность действий. \n"
            "Его руки уверенно перемешивали смеси, а глаза сверкали от решимости и умения.\n"
            "Наконец, после некоторого времени и сосредоточенной работы, перед героем появилась ампула с блестящим жидким лекарством.\n")

def posle():
    return ("Герой выбрался из лаборатории и оказался в темном коридоре, окруженном тишиной и зловещей атмосферой.\n"
            "Его сердце билось сильнее, когда он услышал шаги и стоны зомби вдали. Он спешно двигался по коридору,\n"
            "оберегая ампулу с антидотом, зная, что в любой момент может столкнуться с опасностью.\n"
            "Наконец, герой добрался до выхода из подвала и вышел на базу, где его уже ждали военные.\n"
            "Строго обученные солдаты сразу же обеспечили его защиту и безопасность. Они встретили его с уважением,\n"
            "зная, что он принес важное лекарство, способное помочь в борьбе с зомби-вирусом.\n"
            "Герой передал ампулу с антидотом лидеру отряда, объяснив, как ее применять и какое воздействие она окажет на зараженных.\n"
            "Военные приняли лекарство с благодарностью и обещали использовать его для спасения людей и остановки распространения вируса.\n"
            "С чувством облегчения герой ложится спать, зная, что его открытие поможет спасти мир от ужасной угрозы зомби-вируса.\n")

def no_time():
    return ("Время вышло... вы не успели..."
            "Герой выбрался из лаборатории и оказался в темном коридоре, окруженном тишиной и зловещей атмосферой.\n"
            "Его сердце билось сильнее, когда он услышал шаги и стоны зомби вдали. Он спешно двигался по коридору,\n"
            "Наконец, герой добрался до выхода из подвала и вышел на базу, где его уже ждали военные.\n"
            "Строго обученные солдаты сразу же обеспечили его защиту и безопасность. Они встретили его с уважением,\n"
            "зная, что он принес важное лекарство, способное помочь в борьбе с зомби-вирусом.\n"
            "Но у вас его нет...\n"
            "С чувством грусти и невыполненого долга герой ложится спать, зная, что делая все чуточку быстрее он бы сумел\n"
            "спасти мир от ужасной угрозы зомби-вируса.\n")