def first_end():
    return ("*****************************************"
            "\nВы погибли. Мир стал 1 зомби больше\n"
            "        [1 концовка смерть]\n"
            "*****************************************\n")


def first_end_2():
    return ("*********************************************"
            "\nВы погибли. Лучше не подходить к незнакомцам\n"
            "        [1 концовка смерть]\n"
            "*********************************************\n")


def first_end_3():
    return ("*****************************************"
            "\nВы погибли. Надо было думать лучше...\n"
            "        [1 концовка смерть]\n"
            "*****************************************\n")


def second_end():
    return ("************************************************************"
            "\n                   Вы спасли мир!\n"
            "         создав лекарство и передав его военным\n"
            "                [2 концовка хапи энд]\n"
            "************************************************************\n")


def third_ens():
    return ("************************************************************\n"
            "                       Мир обречен!\n"
            "              Вы не успели создать лекарство\n"
            "                  [3 концовка бэд энд]\n"
            "************************************************************\n\n")


def first_end_4():
    return ("******************************************************************\n"
            "                   Вы погибли в неравном бою\n"
            "                      [1 концовка смерть]\n"
            "******************************************************************\n")